#pragma once
#include "common/defs.hpp"
#include "common/runtime/HashmapSmall.hpp"
#include "common/runtime/SIMD.hpp"
#include "common/runtime/Types.hpp"
#include "common/runtime/Util.hpp"
#include "vectorwise/VectorAllocator.hpp"
#include "vectorwise/defs.hpp"
#include <unordered_map>
// #include "/home/kersten/tools/iaca-lin64/iacaMarks.h"

namespace vectorwise {
namespace primitives {

//------------------------------------------------------------------------------
//--- selection templates
template <typename T, template <typename> class Op>
pos_t sel_col_val(pos_t n, pos_t* RES result, T* RES param1, T* RES param2)
/// select with column and constant
{
   uint64_t found = 0;
   const auto& con = *param2;
   for (uint64_t i = 0; i < n; ++i)
      if (Op<T>()(param1[i], con)) result[found++] = i;
   return found;
}

template <typename T, template <typename> class Op>
pos_t sel_col_val_or_val(pos_t n, pos_t* RES result, T* RES param1,
                         T* RES param2, T* RES param3)
/// select with column and two possible constants
{
   const auto& con1 = *param2;
   const auto& con2 = *param3;
   auto rStart = result;
   for (uint64_t i = 0; i < n; ++i) {
     bool decision = Op<T>()(param1[i], con1) | Op<T>()(param1[i], con2);
     *result = i;
     result += decision;
   }
   return result - rStart;
}

template <typename T, template <typename> class Op>
pos_t sel_col_col(pos_t n, pos_t* RES result, T* RES param1, T* RES param2)
/// select two columns
{

      const auto idx2 = inSel2[i];
      result[i] = Op<T>()(param1[idx1], param2[idx2]);
   }
   return n;
}

template <typename T, typename R, template <typename> class Op>
pos_t apply_col(pos_t n, R* RES result, T* RES param1)
/// project with input selection vector and constant and column
{
   for (uint64_t i = 0; i < n; ++i) { result[i] = Op<T>()(param1[i]); }
   return n;
}

template <typename T, typename R, template <typename> class Op>
pos_t apply_sel_col(pos_t n, R* RES result, pos_t* RES inSel, T* RES param1)
/// project with input selection vector and constant and column
{
   for (uint64_t i = 0; i < n; ++i) {
      const auto idx = inSel[i];
      result[i] = Op<T>()(param1[idx]);
   }
   return n;
}

//------------------------------------------------------------------------------
//--- aggregation templates
template <typename T, template <typename> class Op>
pos_t aggr_static_col(pos_t n, T* RES result, T* RES param1)
/// aggregate column into single value
{
   auto aggregator = *result;
   for (uint64_t i = 0; i < n; ++i) aggregator = Op<T>()(param1[i], aggregator);
   *result = aggregator;
   return n > 0;
}

template <typename T, template <typename> class Op>
pos_t aggr_static_sel_col(pos_t n, pos_t* RES inSel, T* RES result,
                          T* RES param1)
/// aggregate with input selection vector and column into single value
{
   auto aggregator = *result;
   for (uint64_t i = 0; i < n; ++i) {
      const auto idx = inSel[i];
      aggregator = Op<T>()(param1[idx], aggregator);
   }
   *result = aggregator;
   return n;
}

template <typename T, template <typename> class Op>
pos_t aggr_col(pos_t n, T* RES entries[], T* RES param1, size_t offset)
/// aggregate into multiple aggregators given by result
{
   auto p1 = param1;
   for (auto e = entries, end = e + n; e < end; ++e, ++p1) {
      auto aggregate = addBytes(*e, offset);
      *aggregate = Op<T>()(*p1, *aggregate);
   }
   return n;
}

template <typename T, template <typename> class Op>
pos_t aggr_sel_col(pos_t n, T* RES entries[], pos_t* selParam1, T* RES param1,
                   size_t offset)
/// aggregate into multiple aggregators given by result, param1 has selection
/// vector
{
   auto s = selParam1;
   for (auto e = entries, end = e + n; e < end; ++e, ++s) {
      auto aggregate = addBytes(*e, offset);
      *aggregate = Op<T>()(param1[*s], *aggregate);
   }
   return n;
}

template <typename T, template <typename> class Op>
pos_t aggr_row(pos_t n, T* RES entries[], size_t offset, T** RES dataPtr,
               size_t* inSizePtr, size_t inOffset)
/// aggregate into multiple aggregators given by result
{
   auto data = addBytes(*dataPtr, inOffset);
   auto inSize = *inSizePtr;
   for (auto e = entries, end = e + n; e < end;
        ++e, data = addBytes(data, inSize)) {
      auto aggregate = addBytes(*e, offset);
      *aggregate = Op<T>()(*data, *aggregate);
   }
   return n;
}

template <typename T, template <typename> class Op> struct OpTraits;
template <typename T> struct OpTraits<T, std::plus> {
   static const T neutral = 0;
};
template <typename T> struct OpTraits<T, std::minus> {
   static const T neutral = 0;
};
template <typename T> struct OpTraits<T, std::multiplies> {
   static const T neutral = 1;
};
template <typename T> struct OpTraits<T, std::divides> {
   static const T neutral = 1;
};
template <typename T> struct OpTraits<T, std::modulus> {
   static const T neutral = 1;
};

template <typename T, template <typename> class Op>
pos_t aggr_init(pos_t n, T** RES toInit, size_t* struct_size, size_t offset) {
   auto step = *struct_size;
   auto current = addBytes(*toInit, offset);
   for (size_t i = 0; i < n; ++i, current = addBytes(current, step))
      *current = OpTraits<T, Op>::neutral;
   return n;
}

//------------------------------------------------------------------------------
//--- scatter templates
template <typename T>
pos_t scatter(pos_t n, T* RES input, T** RES start, size_t* step,
              size_t offset) {
   const auto s = *step;
   auto current = addBytes(*start, offset);
   for (size_t i = 0; i < n; ++i, current = addBytes(current, s))
      *current = input[i];
   return n;
}

template <typename T>
pos_t scatter_sel(pos_t n, pos_t* RES inSel, T* RES input, T** RES start,
                  size_t* step, size_t offset) {
   const auto s = *step;
   auto current = addBytes(*start, offset);
   for (uint64_t i = 0; i < n; ++i, current = addBytes(current, s))
      *current = input[inSel[i]];
   return n;
}

template <typename T>
pos_t scatter_sel_row(pos_t n, pos_t* RES inSel, T** RES inputPtr,
                      size_t* inStepPtr, size_t inOffset, T** RES start,
                      size_t* step, size_t offset) {
   const auto s = *step;
   auto input = *inputPtr;
   auto inStep = *inStepPtr;
   auto current = addBytes(*start, offset);
   for (uint64_t i = 0; i < n; ++i, current = addBytes(current, s))
      *current = *addBytes(input, inSel[i] * inStep + inOffset);
   return n;
}

//------------------------------------------------------------------------------
//--- gather templates
template <typename T>
pos_t gather_col(pos_t n, T* RES input[], size_t offset, T* RES out)
/// gathers using a list of pointers
{
   for (size_t i = 0; i < n; ++i) out[i] = *addBytes(input[i], offset);
   return n;
}

template <typename T>
pos_t gather_sel_col(pos_t n, pos_t* RES inSel, T* RES input[], size_t offset,
                     T* RES out)
/// gathers using a selection vector into a list of pointers
{
   for (size_t i = 0; i < n; ++i) {
      const auto idx = inSel[i];
      out[i] = *addBytes(input[idx], offset);
   }
   return n;
}

template <typename T>
pos_t gather_val(pos_t n, T** RES input, size_t offset, size_t* struct_size,
                 T* RES out)
/// gathers from a block of memory
{
   auto current = addBytes(*input, offset);
   auto size = *struct_size;
   for (size_t i = 0; i < n; ++i) {
      out[i] = *current;
      current = addBytes(current, size);
   }
   return n;
}

//------------------------------------------------------------------------------
//--- hashing templates
using hash_t = defs::hash_t;
#if HASH_SIZE == 32
const hash_t seed = 4000932304;
#else
const hash_t seed = 29875498475984;
#endif

template <typename T, typename Op>
pos_t hash(pos_t n, hash_t* RES result, T* RES input)
/// compute hash for input column
{
   for (uint64_t i = 0; i < n; ++i) result[i] = Op()(input[i], seed);
   return n;
}

template <typename T, typename Op>
pos_t hash_sel(pos_t n, pos_t* RES inSel, hash_t* RES result, T* RES input)
/// compute hash for input column
{
   for (uint64_t i = 0; i < n; ++i) {
      // IACA_START
      const auto idx = inSel[i];
      result[i] = Op()(input[idx], seed);
   }
   // IACA_END
   return n;
}

template <typename T, typename Op>
pos_t rehash(pos_t n, hash_t* RES result, T* RES input)
/// compute hash for input column, taking the value in result as seed
{
   for (uint64_t i = 0; i < n; ++i) result[i] = Op()(input[i], result[i]);
   return n;
}

template <typename T, typename Op>
pos_t rehash_sel(pos_t n, pos_t* RES inSel, hash_t* RES result, T* RES input)
/// compute hash for input column with selection vector, taking the value in
/// result as seed
{
   for (uint64_t i = 0; i < n; ++i) {
      const auto idx = inSel[i];
      result[i] = Op()(input[idx], result[i]);
   }
   return n;
}

template <typename T, typename Op>
pos_t hash8(pos_t n, hash_t* RES result, T* RES input)
/// compute hash for input column
{
   static_assert(sizeof(T) == 8, "Can only be used for inputs types of size 8");
   size_t rest = n % 8;
   Vec8u seeds(seed);
   for (uint64_t i = 0; i < n - rest; i += 8) {
      Vec8u in(input + i);
      auto hashes = Op().hashKey(
          in, seeds); // function call operator overloading is not working ?!
      _mm512_store_epi64(result + i, hashes);
   }
   if (rest) {
      __mmask8 remaining = (1 << rest) - 1;
      Vec8u in = _mm512_maskz_loadu_epi64(remaining, input + n - rest);
      auto hashes = Op().hashKey(in, seeds);
      _mm512_mask_store_epi64(result + n - rest, remaining, hashes);
   }
   return n;
}

template <typename T, typename Op>
pos_t hash4(pos_t n, hash_t* RES result, T* RES input)
/// compute hash for input column
{
   static_assert(sizeof(T) == 4, "Can only be used for inputs types of size 4");
   size_t rest = n % 8;
   Vec8u seeds(seed);
   for (uint64_t i = 0; i < n - rest; i += 8) {
      Vec8u in(_mm512_cvtepu32_epi64(
          _mm256_loadu_si256((const __m256i*)(input + i))));
      auto hashes = Op().hashKey(
          in, seeds); // function call operator overloading is not working ?!
      // _mm512_store_epi64(result + i, hashes);
      _mm512_mask_storeu_epi64(result + i, ~0, hashes);
   }
   if (rest) {
      __mmask16 remaining = (1 << rest) - 1;
      Vec8u in(_mm512_cvtepu32_epi64(
          _mm256_maskz_loadu_epi32(remaining, input + n - rest)));
      auto hashes = Op().hashKey(in, seeds);
      _mm512_mask_storeu_epi64(result + n - rest, remaining, hashes);
   }
   return n;
}

template <typename T, typename Op>
pos_t hash4_16(pos_t n, hash_t* RES result, T* RES input)
/// compute hash for input column
{
   static_assert(sizeof(T) == 4, "Can only be used for inputs types of size 4");
   size_t rest = n % 16;
   Vec16u seeds(seed);
   for (uint64_t i = 0; i < n - rest; i += 16) {
      Vec16u in(input + i);
      auto hashes = Op().hashKey(
          in, seeds); // function call operator overloading is not working ?!
      // _mm512_store_epi64(result + i, hashes);
      _mm512_mask_storeu_epi64(result + i, ~0, hashes);
   }
   if (rest) {
      __mmask16 remaining = (1 << rest) - 1;
      Vec16u in(input + n - rest);
      auto hashes = Op().hashKey(in, seeds);
      _mm512_mask_storeu_epi64(result + n - rest, remaining, hashes);
   }
   return n;
}

template <typename T, typename Op>
pos_t rehash4(pos_t n, hash_t* RES result, T* RES input)
/// compute hash for input column
{
   static_assert(sizeof(T) == 4, "Can only be used for inputs types of size 4");
   size_t rest = n % 8;
   for (uint64_t i = 0; i < n - rest; i += 8) {
      Vec8u seeds(result + i);
      Vec8u in(_mm512_cvtepu32_epi64(
          _mm256_loadu_si256((const __m256i*)(input + i))));
      auto hashes = Op().hashKey(
          in, seeds); // function call operator overloading is not working ?!
      // _mm512_store_epi64(result + i, hashes);
      _mm512_mask_storeu_epi64(result + i, ~0, hashes);
   }
   if (rest) {
      __mmask16 remaining = (1 << rest) - 1;
      Vec8u seeds = _mm512_maskz_loadu_epi64(remaining, result + n - rest);
      Vec8u in(_mm512_cvtepu32_epi64(
          _mm256_maskz_loadu_epi32(remaining, input + n - rest)));
      auto hashes = Op().hashKey(in, seeds);
      _mm512_mask_storeu_epi64(result + n - rest, remaining, hashes);
   }
   return n;
}

template <typename T, typename Op>
pos_t rehash4_16(pos_t n, hash_t* RES result, T* RES input)
/// compute hash for input column
{
   static_assert(sizeof(T) == 4, "Can only be used for inputs types of size 4");
   size_t rest = n % 16;
   for (uint64_t i = 0; i < n - rest; i += 16) {
      Vec16u seeds(result + i);
      Vec16u in(input + i);
      auto hashes = Op().hashKey(
          in, seeds); // function call operator overloading is not working ?!
      // _mm512_store_epi64(result + i, hashes);
      _mm512_mask_storeu_epi64(result + i, ~0, hashes);
   }
   if (rest) {
      __mmask16 remaining = (1 << rest) - 1;
      Vec16u seeds = _mm512_maskz_loadu_epi64(remaining, result + n - rest);
      Vec16u in(input + n - rest);
      auto hashes = Op().hashKey(in, seeds);
      _mm512_mask_storeu_epi64(result + n - rest, remaining, hashes);
   }
   return n;
}

template <typename T, typename Op>
pos_t hash4_sel(pos_t n, pos_t* RES inSel, hash_t* RES result, T* RES input)
/// compute hash for input column
{
   static_assert(sizeof(T) == 4, "Can only be used for inputs types of size 4");
   size_t rest = n % 8;
   Vec8u seeds(seed);
   __mmask16 all = ~0;
   for (uint64_t i = 0; i < n - rest; i += 8) {
      auto inSels = _mm256_loadu_si256((const __m256i*)(inSel + i));
      Vec8u in = _mm512_cvtepu32_epi64(
          _mm256_mmask_i32gather_epi32(inSels, all, inSels, input, 4));
      auto hashes = Op().hashKey(
          in, seeds); // function call operator overloading is not working ?!
      _mm512_mask_storeu_epi64(result + i, all, hashes);
   }
   if (rest) {
      __mmask16 remaining = (1 << rest) - 1;
      auto inSels = _mm256_loadu_si256(
          (const __m256i*)(inSel + n - rest)); // ignore mask here?
      Vec8u in = _mm512_cvtepu32_epi64(
          _mm256_mmask_i32gather_epi32(inSels, remaining, inSels, input, 4));
      auto hashes = Op().hashKey(in, seeds);
      _mm512_mask_storeu_epi64(result + n - rest, remaining, hashes);
   }
   return n;
}

template <typename T, typename Op>
pos_t hash4_16_sel(pos_t n, pos_t* RES inSel, hash_t* RES result, T* RES input)
/// compute hash for input column
{
   static_assert(sizeof(T) == 4, "Can only be used for inputs types of size 4");
   size_t rest = n % 16;
   Vec16u seeds(seed);
   __mmask16 all = ~0;
   for (uint64_t i = 0; i < n - rest; i += 16) {
      Vec16u inSels(inSel + i);
      Vec16u in = _mm512_i32gather_epi32(inSels, input, 4);
      auto hashes = Op().hashKey(in, seeds);
      _mm512_mask_storeu_epi64(result + i, all, hashes);
   }
   if (rest) {
      __mmask16 remaining = (1 << rest) - 1;
      Vec16u inSels(inSel + n - rest);
      Vec16u in = _mm512_mask_i32gather_epi32(inSels, all, inSels, input, 4);
      auto hashes = Op().hashKey(in, seeds);
      _mm512_mask_storeu_epi64(result + n - rest, remaining, hashes);
   }
   return n;
}

template <typename T, typename Op>
pos_t rehash4_sel(pos_t n, pos_t* RES inSel, hash_t* RES result, T* RES input)
/// compute hash for input column
{
   static_assert(sizeof(T) == 4, "Can only be used for inputs types of size 4");
   size_t rest = n % 8;
   for (uint64_t i = 0; i < n - rest; i += 8) {
      Vec8u seeds(result + i);
      auto inSels = _mm256_loadu_si256((const __m256i*)(inSel + i));
      Vec8u in = _mm512_cvtepu32_epi64(
          _mm256_mmask_i32gather_epi32(inSels, ~0, inSels, input, 4));
      auto hashes = Op().hashKey(
          in, seeds); // function call operator overloading is not working ?!
      _mm512_mask_storeu_epi64(result + i, ~0, hashes); // ??
   }
   if (rest) {
      __mmask16 remaining = (1 << rest) - 1;
      Vec8u seeds = _mm512_maskz_loadu_epi64(remaining, result + n - rest);
      auto inSels = _mm256_loadu_si256(
          (const __m256i*)(inSel + n - rest)); // ignore mask here?
      Vec8u in = _mm512_cvtepu32_epi64(
          _mm256_mmask_i32gather_epi32(inSels, remaining, inSels, input, 4));
      auto hashes = Op().hashKey(in, seeds);
      _mm512_mask_storeu_epi64(result + n - rest, remaining, hashes); // ??
   }
   return n;
}

template <typename T, typename Op>
pos_t rehash4_16_sel(pos_t n, pos_t* RES inSel, hash_t* RES result,
                     T* RES input)
/// compute hash for input column
{
   static_assert(sizeof(T) == 4, "Can only be used for inputs types of size 4");
   size_t rest = n % 16;
   for (uint64_t i = 0; i < n - rest; i += 16) {
      Vec16u seeds(result + i);
      Vec16u inSels(inSel + i);
      Vec16u in = _mm512_i32gather_epi32(inSels, input, 4);
      auto hashes = Op().hashKey(
          in, seeds); // function call operator overloading is not working ?!
      _mm512_mask_storeu_epi64(result + i, ~0, hashes); // ??
   }
   if (rest) {
      __mmask16 remaining = (1 << rest) - 1;
      Vec16u seeds = _mm512_maskz_loadu_epi64(remaining, result + n - rest);
      Vec16u inSels(inSel + n - rest);
      Vec16u in =
          _mm512_mask_i32gather_epi32(inSels, remaining, inSels, input, 4);
      auto hashes = Op().hashKey(in, seeds);
      _mm512_mask_storeu_epi64(result + n - rest, remaining, hashes);
   }
   return n;
}
//------------------------------------------------------------------------------
//--- key equality check for hashjoin
